from django.db import models


class RoleType(models.IntegerChoices):
    """
    用户角色表
    """

    BASIC = 0, "用户基类"
    STUDENT = 1, "学生"
    MANAGER = 2, "管理员"


class GenderType(models.IntegerChoices):
    """
    性别，主要用于用户表
    """

    UNKNOWN = 0, "未知"
    MALE = 1, "男"
    FEMALE = 2, "女"


class CollegeData:
    college_choices = (
        (0, '文学院'),
        (1, '历史学院'),
        (2, '哲学学院'),
        (3, '外国语言文学学院'),
        (4, '新闻与传播学院'),
        (5, '艺术学院'),
        (6, '信息管理学院'),
        (7, '经济与管理学院'),
        (8, '法学院'),
        (9, '政治与公共管理学院'),
        (10, '马克思主义学院'),
        (11, '社会学院'),
        (12, '数学与统计学院'),
        (13, '物理与科学技术学院'),
        (14, '化学与分子科学学院'),
        (15, '生命科学学院'),
        (16, '水利水电学院'),
        (17, '电气与自动化学院'),
        (18, '动力与机械学院'),
        (19, '城市设计学院'),
        (20, '土木建筑工程学院'),
        (21, '计算机学院'),
        (22, '电子信息学院'),
        (23, '遥感信息工程学院'),
        (24, '国家网络安全学院'),
        (25, '测绘学院'),
        (26, '资源与环境科学学院'),
        (27, '泰康医学院（基础医学院）'),
        (28, '口腔医学院'),
        (29, '药学院'),
        (30, '公共卫生学院'),
        (31, '护理学院'),
        (32, '第一临床医学院'),
        (33, '第二临床医学院'),
        (34, '弘毅学堂'),
    )

    major_choices = {
        0: (
            (0, '汉语言文学'),
            (1, '汉语国际教育'),
            (2, '汉语言文学(古文字学方向)')
        ),
        1: (
            (0, '世界史'),
            (1, '考古学'),
            (2, '历史学')
        ),
        2: (
            (0, '哲学（含哲学、现代哲学国际班、宗教学）'),
            (1, '心理学专业'),
            (2, '强基班'),
        ),
        3: (
            (0, '英语'),
            (1, '俄语'),
            (2, '法语'),
            (3, '德语'),
            (4, '日语'),
            (5, '西班牙语'),
            (6, '翻译学'),
        ),
        4: (
            (0, '新闻学'),
            (1, '传播学'),
            (2, '广告学'),
            (3, '播音与主持艺术'),
        ),
        5: (
            (0, '表演'),
            (1, '戏剧影视文学'),
        ),
        6: (
            (0, '社会科学试验班'),
            (1, '信息管理与信息系统'),
        ),
        7: (
            (0, '市场营销'),
            (1, '保险学'),
            (2, '金融学'),
            (3, '工商管理'),
            (4, '财政学'),
            (5, '人力资源管理'),
            (6, '经济学'),
            (7, '国际经济与贸易'),
            (8, '金融工程'),
            (9, '会计学'),
            (10, '物流管理'),
            (11, '财务管理'),
        ),
        8: (
            (0, '法学'),
        ),
        9: (
            (0, '政治学与行政学'),
            (1, '外交学'),
            (2, '劳动与社会保障'),
            (3, '行政管理'),
            (4, '公共事业管理'),
        ),
        10: (
            (0, '马克思主义理论大类'),
        ),
        11: (
            (0, '社会学专业'),
        ),
        12: (
            (0, '统计学'),
            (1, '数学与应用数学'),
        ),
        13: (
            (0, '物理学'),
        ),
        14: (
            (0, '化学'),
            (1, '应用化学'),
            (2, '化学专业化学生物方向'),
        ),
        15: (
            (0, '生物科学'),
        ),
        16: (
            (0, '水利水电工程'),
            (1, '水文与水资源工程'),
            (2, '港口航道及海岸工程'),
            (3, '农业水利工程'),
        ),
        17: (
            (0, '自动化'),
            (1, '电气工程及其自动化'),
        ),
        18: (
            (0, '能源与动力工程'),
            (1, '能源化学工程'),
            (2, '机械设计制造及其自动化'),
            (3, '材料学'),
        ),
        19: (
            (0, '建筑学'),
            (1, '城乡规划'),
        ),
        20: (
            (0, '给排水科学与工程'),
            (1, '工程力学'),
            (2, '土木工程'),
        ),
        21: (
            (0, '软件工程'),
            (1, '计算机科学与技术'),
            (2, '人工智能'),
        ),
        22: (
            (0, '测控技术与仪器'),
            (1, '通信工程'),
            (2, '电子信息工程'),
            (3, '电波传播与天线'),
        ),
        23: (
            (0, '遥感科学与技术'),
            (1, '地理国情监测'),
            (2, '空间信息与数字技术'),
        ),
        24: (
            (0, '信息安全'),
            (1, '网络空间安全'),
            (2, '密码学'),
        ),
        25: (
            (0, '导航工程'),
            (1, '测绘工程'),
            (2, '地球物理学'),
        ),
        26: (
            (0, '空间信息与资源环境类'),
            (1, '地理信息科学'),
            (2, '地理科学'),
            (3, '人文地理与城乡规划'),
            (4, '环境工程'),
            (5, '环境科学'),
            (6, '土地资源管理'),
        ),
        27: (
            (0, '基础医学'),
        ),
        28: (
            (0, '口腔医学（五年制）'),
        ),
        29: (
            (0, '药学'),
            (1, '生物制药'),
        ),
        30: (
            (0, '公共卫生与预防医学'),
        ),
        31: (
            (0, '护理学')
        ),
        32: (
            (0, '临床医学（五加三一体化）'),
        ),
        33: (
            (0, '临床医学'),
        ),
        34: (
            (0, '国学'),
            (1, '弘毅学堂'),
        ),
    }
